#include "../../../Core/Library/Library.h"


string FetchApiData(string url)
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	size_t pos = url.find("my_dev_key");
	if (pos != string::npos)
	{
		return "Початковий розробник програмного забезпечення із знанням HTML, CSS, Python та C++. Маю базовий рівень навичок у веб-розробці та програмуванні, добре розумію основи створення веб-сайтів та розробки програм. Готовий вдосконалювати свої навички та використовувати їх для досягнення успіху у сфері розробки програмного забезпечення";
	}
	else
	{
		return "Студент з великим інтересом до розробки програмного забезпечення та розвитку технічних навичок. Маю основні вміння у HTML, CSS, Python та C++. Активно займаюся самостійним вивченням нових технологій та поглибленням знань у сфері програмування. Готовий до використання отриманих навичок у практичних проектах та пошуку можливостей для професійного зростання.";
	}
}